In [ ]:
"""
优先使用 loc：当需要基于标签选择行或列时，loc 更明确且功能更全面
专门用于基于标签的行或列选择。例如，df.loc['a'] 选择索引标签为 'a' 的行。

切片基于标签范围，且为前闭后闭。例如，df.loc['a':'c'] 包含起始和结束标签。
"""
import pandas as pd
import numpy as np

obj1 = pd.Series([1, 2, 3], index=[2, 0, 1])
obj2 = pd.Series([1, 2, 3], index=["a", "b", "c"])

print(obj1)
obj2

2    1
0    2
1    3
dtype: int64

a    1
b    2
c    3
dtype: int64

In [2]:
#标签索引,即通过索引标签（可能是整数、字符串或其他类型）选择数据
print(obj1[[0,1,2]])
print(obj1.loc[[0,1,2]])

#位置索引,严格按照行号（0、1、2）选择数据，与索引标签无关
print(obj1.iloc[[0,1,2]])

0    2
1    3
2    1
dtype: int64
0    2
1    3
2    1
dtype: int64
2    1
0    2
1    3
dtype: int64

In [3]:
#loc只能使用标签(可能是整数、字符串或其他类型),如果索引中不含整数,那么就会失效使用loc[0]
obj2.loc[0]#KeyError

KeyError: 0

In [ ]:
obj2.loc["a"]

np.int64(1)

In [ ]:
#iloc只能使用整数,但无论索引是否包含整数,iloc都能使用
obj1.iloc[[0,1,2]]

2    1
0    2
1    3
dtype: int64

In [ ]:
obj2.iloc[[0,1,2]]

a    1
b    2
c    3
dtype: int64

In [ ]:
obj2.iloc["a"]#TypeError ,Cannot index by location index with a non-integer key

In [ ]:
"""
对于整数索引,loc,iloc都可以,非整数索引建议loc
"""

In [ ]:
#loc切片(标签切片),与Python方法(位置切片)不一样,包含末端
#切片基于标签范围，且为前闭后闭。例如，df.loc['a':'c'] 包含起始和结束标签。
obj2

a    1
b    2
c    3
dtype: int64

In [ ]:
obj2["a":"c"]

a    1
b    2
c    3
dtype: int64

In [ ]:
obj2[0:2]

a    1
b    2
dtype: int64

In [ ]:
obj2.loc["a":"c"]

a    1
b    2
c    3
dtype: int64

In [ ]:
obj2.iloc[0:2]#lioc位置切片

a    1
b    2
dtype: int64

In [ ]:
#使用切片方法还可以对series赋值
obj2.loc[["a","c"]]=5
obj2

a    5
b    2
c    5
dtype: int64

In [ ]:
#用单个值或序列对dataframe进行索引,获取单列或多列
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                    index=["Ohio", "Colorado", "Utah", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
#选取列,向[]传入单个值,或者列表就可以选择列
print(data["four"])
data[["one","two"]]

Ohio         3
Colorado     7
Utah        11
New York    15
Name: four, dtype: int64

          one  two
Ohio        0    1
Colorado    4    5
Utah        8    9
New York   12   13

In [ ]:
#特殊用法可以通过切片或布尔数组选取数据,#选行
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [ ]:
#布尔series作用:选取行

data["three"]>5

Ohio        False
Colorado     True
Utah         True
New York     True
Name: three, dtype: bool

In [ ]:
data[data["three"]>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [ ]:
#使用  布尔型dataframe  进行索引,先通过dataframe与标量比较得到
data>5

            one    two  three   four
Ohio      False  False  False  False
Colorado  False  False   True   True
Utah       True   True   True   True
New York   True   True   True   True

In [ ]:
#让true的地方都等于0
data[data>5]=0
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      0     0
Utah        0    0      0     0
New York    0    0      0     0

In [ ]:
#用loc和iloc选取dataframe

#取单行,取出的是series,他的索引是dataframe的列标签
data.loc["Ohio"]

one      0
two      1
three    2
four     3
Name: Ohio, dtype: int64

In [ ]:
#取多行,传入索引列表
data.loc[["Utah","New York"]]

          one  two  three  four
Utah        0    0      0     0
New York    0    0      0     0

In [ ]:
#使用loc同时选取行和列可以使用逗号隔开
data.loc[["Utah","New York","Ohio"],["two","four"]]

          two  four
Utah        0     0
New York    0     0
Ohio        1     3

In [ ]:
#总结:取行:用loc,取列用[],同时取列和行可以loc[[行索引],[列索引]]

In [ ]:
#利用iloc和整数索引做一些相似的选取动作
data.iloc[0]

one      0
two      1
three    2
four     3
Name: Ohio, dtype: int64

In [ ]:
data.iloc[[0,3]]#选取多行

          one  two  three  four
Ohio        0    1      2     3
New York    0    0      0     0

In [ ]:
data.iloc[1,[0,1]]#选取第二行,前2项,单独取出一行还是数组

one    4
two    5
Name: Colorado, dtype: int64

In [ ]:
data.iloc[[1,3],[0,1]]#2,4行,1,2列

          one  two
Colorado    4    5
New York    0    0

In [ ]:
#iloc和loc这2个索引函数也可以使用切片
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      0     0
Utah        0    0      0     0
New York    0    0      0     0

In [ ]:
#(loc标签)切片与索引共用
data.loc[:"Utah",["two","three"]]

          two  three
Ohio        1      2
Colorado    5      0
Utah        0      0

In [ ]:
#(iloc位置)切片   只能用整数
data2=data.iloc[:3,:3]
data2

          one  two  three
Ohio        0    1      2
Colorado    4    5      0
Utah        0    0      0

In [ ]:
#使用布尔型数组
data2[data2.three>0]

      one  two  three
Ohio    0    1      2

In [ ]:
#loc可以使用布尔数组,iloc不可以
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      0     0
Utah        0    0      0     0
New York    0    0      0     0

In [ ]:
data.loc[data.three<2]

          one  two  three  four
Colorado    4    5      0     0
Utah        0    0      0     0
New York    0    0      0     0